{
  "main": {
    "name": "Abhishek Kumar",
    "occupation": "Technical Lead",
    "description": "",
    "image": "profilepic.png",
    "bio": [
      "🚀 Who I Am: I’m a software developer with over 8+ years of experience specializing in high-performance web and mobile applications, as well as sophisticated backend solutions.",
      "🛠️ My Technical Journey: I have successfully delivered numerous projects across domains like embedded systems and IoT, bridging technical and strategic development.",
      "💼 Professional Highlights: I have contributed to complex projects requiring deep technical knowledge, transitioning seamlessly between development and tech-integrated marketing strategies.",
      "🤖 AI & Machine Learning Enthusiast: I am passionate about leveraging AI to predict user behavior and automate processes, enhancing efficiency and accuracy.",
      "🌐 Beyond Code: I combine technology and marketing to create analytical and creative solutions, driving success in competitive markets."
    ],
    "contactmessage": "Get in touch with me",
    "email": "abhi.op.93@gmail.com",
    "phone": "+91 7975567840",
    "address": {
      "city": "Bengaluru",
      "state": "Karnataka"
    },
    "website": "www.abtech.co.in",
    "resumedownload": "https://drive.google.com/file/d/1fWXwqJIzppM444s5vAQ4PDFS4bnKpuHd/view?usp=drive_link",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/abhishek-dev-mern/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/abhi62",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "",
    "education": [
      {
        "school": "Bachelor's Degree,",
        "description": "Mechanical Engineering"
      }
    ],
    "work": [
      {
        "company": "Groyyo (Apr 2022 - Now)",
        "title": "<u>Tech Lead (React, React Native, Storybook, JS, LLM)</u>",
        "years": "July 2023 - Now",
        "description": [
          "<b>AI Agent Development:</b> Built an AI agent for the apparel industry on web and mobile using React, React Native, and ML models.",
          "<b>UI Component Library:</b> Developed a scalable component library with Storybook and custom CSS.",
          "<b>Team Mentorship:</b> Mentored 8+ developers, enhancing their skills and project outcomes.",
          "<b>ERP Solution:</b> Led the development of Groyyo Plus, an ERP solution with a React Native app and React dashboard."
        ]
      },
      {
        "company": "",
        "title": "<u>Senior Product Developer (React, Material UI, Figma, Tailwind)</u>",
        "years": "Jan 2023 - July 2023",
        "description": [
          "<b>UI Development Lead:</b> Led the UI development for Intent360, including modules like Quality, Production, Planning, and Inventory, using React-, Material UI, Figma, and Tailwind CSS",
          "<b>User-Friendly Interfaces:</b> Built intuitive UIs focused on enhancing usability and user experience."
        ]
      },
      {
        "company": "",
        "title": "<u>Product Developer (Next.js, Cypress, MUI)</u>",
        "years": "Apr 2022 - Dec 2022",
        "description": [
          "<b>Core Product UI & Landing Pages:</b> Delivered seamless UI for core products and dynamic marketing landing pages, driving user engagement.",
          "<b>E-commerce System:</b> Built an e-commerce platform with dynamic product displays and optimized checkouts using Next.js."
        ]
      },
      {
        "company": "Sarva Yoga (Zorba Renaissance Pvt. Ltd)",
        "title": "<u>Software Engineer(Gatsbi, MUI, CMS, styled component, cypress, seo)</u>",
        "years": "July 2021 - Nov 2021",
        "description": [
          "<b>Front-End Development:</b> Led the development of Front End UI and marketing pages using Gatsby and ReactJS, ensuring a seamless user experience and brand consistency",
          "<b>Testing & Quality Assurance:</b> Implemented test cases with Cypress to validate UI functionality and deliver high-quality outputs.",
          "<b>SEO Optimization:</b> Optimized web pages for SEO, boosting search engine rankings and improving organic visibility.",
          "<b>Styling Frameworks:</b> Utilized Material UI and Styled Components to enhance styling effciency and user engagement.",
          "<b>Headless CMS Integration:</b> Integrated Contentful for backend management and employed GraphQL for effcient content querying.",
          "<b>UI Documentation:</b> Leveraged Storybook for comprehensive UI documentation, promoting collaboration and consistency across teams."
        ]
      },
      {
        "company": "Pixotrack pvt ltd (Jun 2019 - Nov 2020)",
        "title": "<u>Co-founder and Web Engineer</u>",
        "years": "Jun 2019 - Nov 2020",
        "description": [
          "<b>Product Development:</b> Oversaw the end-to-end digital product lifecycle, from design and development to testing and deployment.",
          "<b>E-commerce Platform:</b> Architected and built an e-commerce platform using Figma and the MERN stack, enhancing scalability and user experience.",
          "<b>Team Leadership:</b> Directed a team of 8 developers, ensuring collaboration and timely achievement of project milestones.",
          "<b>Process Optimization:</b> Analyzed operational requirements and implemented automation solutions to streamline processes and boost effciency."
        ]
      },
      {
        "company": "APROD MediaTech Pvt. Ltd.(Feb 2016 - Mar 2019)",
        "title": "<u>Web Developer (HTML, CSS, JS, WordPress, PHP)</u>",
        "years": "jan 2017 - Mar 2019",
        "description": [
          "<b>Custom WordPress Development:</b> Designed and developed custom WordPress themes to meet client-specifc requirements, improving functionality and aesthetics.",
          "<b>Dynamic Web Pages:</b> Utilized JavaScript to create interactive web pages, enhancing user engagement and experience.",
          "<b>Email Filter Tool:</b> Engineered an email flter tool to assist the email marketing team in reducing spam rates and optimizing campaigns.",
          "<b>Email Marketing Tool:</b> Led the development of an email marketing tool-, enabling the management of high-value transactions exceeding millions of dollars."
        ]
      },
      {
        "company": "",
        "title": "<u>Intern (HTML, CSS, JS, WordPress)</u>",
        "years": "Fab 2016 - Jan 2017",
        "description": [
          "<b>Email Campaigns:</b> Led email campaign initiatives with the marketing team, driving impactful outreach and effective communication",
          "<b>UI Support:</b> Translated marketing team UI requirements into actionable design solutions.",
          "<b>WordPress Development:</b> Gained expertise in WordPress, developing and managing multiple dynamic blog websites.",
          "<b> Landing Pages:</b> Designed and implemented static landing pages, enhancing user engagement and boosting conversion rates."
        ]
      }
    ],
    "coreSkills": [
      {
        "name": "JavaScript",
        "level": "68%"
      },
      {
        "name": "ReactJS",
        "level": "70%"
      },
      {
        "name": "NextJS",
        "level": "80%"
      },
      {
        "name": "Tailwind",
        "level": "40%"
      },
      {
        "name": "Redux",
        "level": "75%"
      },
      {
        "name": "StoryBook",
        "level": "60%"
      },
      {
        "name": "TypeScript",
        "level": "40%"
      },

      {
        "name": "HTML + CSS",
        "level": "60%"
      },
      {
        "name": "Figma",
        "level": "60%"
      },
      {
        "name": "SEO",
        "level": "60%"
      }
    ],
    "secondarySkills": [
      {
        "name": "NodeJS",
        "level": "68%"
      },
      {
        "name": "ExpressJS",
        "level": "70%"
      },
      {
        "name": "NestJS",
        "level": "80%"
      },
      {
        "name": "Postgresql",
        "level": "40%"
      },
      {
        "name": "LLM",
        "level": "75%"
      },
      {
        "name": " AI Agent",
        "level": "60%"
      },
      {
        "name": "open & Dall-e api",
        "level": "40%"
      },

      {
        "name": "ReactNative",
        "level": "60%"
      },
      {
        "name": "Deployment",
        "level": "60%"
      },
      {
        "name": "Docker",
        "level": "60%"
      },
      {
        "name": "Kuber",
        "level": "60%"
      },
      {
        "name": "Prometheus",
        "level": "60%"
      },
      {
        "name": "Grafana",
        "level": "60%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Sarva front end (Reactjs, GrapgQL, GatsbyJs, Meterial UI, Styled comp)",
        "category": "",
        "image": "sarva.png",
        "url": "https://sarva.com/"
      },
      {
        "title": "Figma food app design",
        "category": "",
        "image": "figma_food.png",
        "url": "#"
      },
      {
        "title": "Instagram clone (Reactjs, Meterial UI, React Hooks.)",
        "category": "",
        "image": "instagram.png",
        "url": "#"
      },
      {
        "title": "Netflix clone Web (ReactJs, CSS, React Hooks, Redux, Firebase)",
        "category": "",
        "image": "netflix-react.png",
        "url": "https://github.com/abhi62/netflix-clone"
      },
      {
        "title": "Snap Chat web (ReactJs, Meterial UI, React Hooks, Redux, Firebase, Firebase store)",
        "category": "",
        "image": "snap-chat.png",
        "url": "https://abhi-snap-clone.web.app/"
      },
      {
        "title": "Tinder clone (MongoDB, Express, React, Node JS)",
        "category": "",
        "image": "tinder.png",
        "url": "https://panda-tinder-app.web.app/"
      },
      {
        "title": "Video Call Web (ReactJs, Meterial UI, React Hooks, Redux, WebRTC Nodejs, Express.)",
        "category": "",
        "image": "video-chat.png",
        "url": "https://panda-video-chat.netlify.app/"
      },
      {
        "title": "Tvastra (Full Stack)",
        "category": "",
        "image": "tvastra-fs.png",
        "url": "https://tavstra-abhi-konf.herokuapp.com/email-login"
      }
    ]
  }
}
